In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import linear_model

In [2]:
df=pd.read_csv("Multi.csv")

In [3]:
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      NaN   18  610000
3  3600      3.0   30  595000
4  4000      5.0    8  760000

In [4]:
#df["bedroom"].median()
df.bedroom.median()

3.5

In [5]:
#here we get an flooting point value(3.5), we need to convert it to integer

In [6]:
import math

In [7]:
int_bedroom=math.floor(df.bedroom.median())
int_bedroom                                    #getting mean from bedroom

3

In [8]:
df["bedroom"]=df["bedroom"].fillna(int_bedroom)

# or  df["bedroom"].fillna(int_bedroom,inplace=True)

#filling median value to bedroom null rows

In [9]:
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      3.0   18  610000
3  3600      3.0   30  595000
4  4000      5.0    8  760000

In [10]:
reg=linear_model.LinearRegression()
reg.fit(df[["area","bedroom","age"]],df.price)

LinearRegression()

In [11]:
reg.predict([[2600,3,20]])

C:\Users\ASUS\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([526000.])

In [12]:
reg.coef_   #m1=137.25 ,m2= -26025.,m3=-6825.

array([   137.25, -26025.  ,  -6825.  ])

In [13]:
reg.intercept_  #b=383724.9999999998

383724.9999999998

In [14]:
#formula is 
# y (price or prediction) = m1x1 + m2x2 + m3x3 + b  
                                                   #independent variable(x1= area,x2=bedroom,x3=age)   
                                                   #m1=137.25 ,m2= -26025.,m3=-6825. b=383724.9999999998  ,y=dependent variable

In [15]:
y=137.25*2600 + -26025.*3 + -6825.*20 +383724.9999999998
y

525999.9999999998

# Exercise

In [18]:
ex=pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv")

In [19]:
ex

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [21]:
ex["test_score(out of 10)"].median()

8.0

In [22]:
ex["test_score(out of 10)"].fillna(ex["test_score(out of 10)"].median(),inplace=True)

In [23]:
ex

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [24]:
ex["experience"].fillna("one",inplace=True)

In [25]:
ex

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        one                    8.0                           9      50000
1        one                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [26]:
pip install word2number
#we need to convert text to int using   word2number library

Requirement already satisfied: word2number in c:\users\asus\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [27]:
from word2number import w2n

In [29]:
ex.experience=ex.experience.apply(w2n.word_to_num)

In [30]:
ex

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           1                    8.0                           9      50000
1           1                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [35]:
mlin=linear_model.LinearRegression()
mlin.fit(ex[["experience","test_score(out of 10)","interview_score(out of 10)"]],ex['salary($)'])

LinearRegression()

In [38]:
mlin.predict([[1,8,9]])

C:\Users\ASUS\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53908.30870106])